Repository: bimarvolo/budget-planner-offline
Catalog: lib/l10n/app_*.arb
Languages: vi

source: Hello World!
vi: Xin chào Thế giới!

source: Budget Planer
vi: Kế hoạch chi tiêu

source: Password
vi: Mật khẩu

source: Confirm Password
vi: Xác nhận mật khẩu

source: Login
vi: Đăng nhập

source: Signup
vi: Đăng ký

source: Signup instead
vi: Link Đăng ký

source: Login instead
vi: Quay lại đăng nhập

source: Incomes
vi: Tổng thu nhập

source: Report
vi: Báo cáo

source: Expense
vi: Chi phí

source: Budget
vi: Ngân sách

source: Account
vi: Tài khoản

source: Progress by category
vi: Tiến độ theo danh mục

source: Budgeted by category
vi: Ngân sách theo danh mục

source: Expenditure by category
vi: Chi tiêu theo danh mục

source: Net incomes
vi: Thu nhập ròng

source: Budgeted
vi: Ngân sách đã lập

source: Remaining to spend
vi: Chi tiêu còn lại

source: Saving
vi: Đang tiết kiệm

source: Expenditure
vi: Đã chi tiêu

source: Provisional Balance
vi: Số dư tạm thời

source: remaining
vi: còn lại

source: over spent
vi: vượt mức chi tiêu

source: Budget Spent
vi: Ngân sách đã chi

source: Budget Planned
vi: Kế hoạch ngân sách

# youDoNotHaveBudgets
source: You don't have any budgets yet
vi: Bạn chưa có bất kỳ ngân sách nào

source: Create first budget
vi: Tạo ngân sách đầu tiên

# useButtonToCreateCategories
source: Use button at the top-right to create categories
vi: Sử dụng nút ở trên cùng bên phải để tạo danh mục

source: Add Category
vi: Thêm danh mục

source: For budget
vi: Cho ngân sách

source: Category type
vi: Loại danh mục

source: Expensive
vi: Chi tiêu

source: Income
vi: Thu nhập

source: Description
vi: Mô tả

# budgetedAmount
source: Budgeted amount for:
vi: Ngân sách cho danh mục :

source: Income goal
vi: Mục tiêu thu nhập

source: Please provide description!
vi: Vui lòng cung cấp mô tả!

source: Please provide a volume!
vi: Vui lòng cung cấp một số lượng!

source: Please provide a valid number!
vi: Vui lòng cung cấp một số hợp lệ!

# pleaseEnterNumberGreaterThanZero
source: Please enter a number greater than zero!
vi: Vui lòng nhập một số lớn hơn 0!

# msgCreateCategorySuccess
source: New category has been created!
vi: Danh mục mới đã được tạo!

# msgCreateCategoryFailed
source: Create category failed!
vi: Tạo danh mục không thành công!

# msgShouldCreateFirstBudget
source: You should create budget first!
vi: Vui lòng tạo ngân sách trước!

source: Confirm
vi: Xác nhận

source: Are you sure you wish to delete this item?
vi: Bạn có chắc chắn muốn xóa mục này không?

source: Delete
vi: Xóa

source: Cancel
vi: Hủy bỏ

source: All budgets
vi: Ngân sách hiện có

source: New budget
vi: Thêm ngân sách

source: This month
vi: Tháng này

source: This week
vi: Tuần này

source: Only today
vi: Chỉ hôm nay

source: Next month
vi: Tháng tới

source: Next week
vi: Tuần tới

source: Start date*:
vi: Ngày bắt đầu *:

source: End date*:
vi: Ngày kết thúc *:

source: Add some categories to this budget?
vi: Thêm một số danh mục vào ngân sách này?

source: Housing
vi: Nhà ở

source: Transportation
vi: Di chuyển

source: Food
vi: Thực phẩm

source: Utilities
vi: Tiện ích

source: Clothing
vi: Quần áo

source: Medical/HealthCare
vi: Y tế / Chăm sóc sức khỏe

source: Education
vi: Giáo dục

source: Entertainment
vi: Giải trí

source: Childcare
vi: Giữ trẻ

source: Insurance
vi: Bảo hiểm

source: Add incomes to this budget?
vi: Thêm thu nhập vào ngân sách này?

source: Salary
vi: Lương

source: Other income
vi: Thu nhập khác

source: You need a budget name?
vi: Bạn cần tên ngân sách?

source: Save
vi: Lưu

source: New budget has been created!
vi: Ngân sách mới đã được tạo!

source: Appearances:
vi: Giao diện :

source: Dart mode
vi: Chế độ tối

source: Light mode
vi: Chế độ sáng

source: Use device settings
vi: Sử dụng cài đặt của thiết bị

# useDeviceSettingsDescription
source: After opening, day or night mode will be followed by device settings
vi: Sau khi mở, chế độ ngày hoặc đêm sẽ được tuân theo cài đặt thiết bị

source: Language:
vi: Ngôn ngữ:

source: Currency:
vi: Tiền tệ:

source: About us
vi: Giới thiệu về chúng tôi

source: Contact
vi: Liên hệ

source: Sign out
vi: Đăng xuất

# errorMessage
source: An Error Occurred!
vi: Đã xảy ra lỗi!

# loginSuccess
source: Your account has been created!
vi: Tài khoản của bạn đã được tạo!

source: Authentication failed
vi: Xác thực không thành công

# couldNotAuthenticate
source: Could not authenticate you. Please try again later!
vi: Không thể xác thực bạn. Vui lòng thử lại sau!

source: Invalid email!
vi: Email không hợp lệ!

source: Password is too short!
vi: Mật khẩu quá ngắn!

source: Passwords do not match!
vi: Mật khẩu không khớp!

# msgRemoveCategorySuccess
source: All expenses of this category has been deleted!
vi: anh mục này đã xóa thành công!

# msgRemoveCategoryFailed
source: Delete category failed!
vi: Xoá danh mục không thành công!

# msgRemoveIncomeSuccess
source: This income has been deleted!
vi: Đã xoá thu nhập thành công!

# msgRemoveIncomeFailed
source: La suppression du revenu a échoué !
vi: Xoá thu nhập không thành công!

# msgNoDateChosen
source: No Date Chosen!
vi: Không có ngày nào được chọn!

# msgCreateBudgetFailed
source: Create budget failed!
vi: Tạo ngân sách không thành công!

# msgCreateBudgetSuccess
source: New budget has been created!
vi: Ngân sách mới đã được tạo!

# msgDeleteBudgetFailed
source: Delete budget failed!
vi: Xóa ngân sách không thành công!

# msgDeleteBudgetSuccess
source: This budget has been deleted!
vi: Ngân sách đã xóa thành công!

# msgDeleteExpenseSuccess
source: This expense has been deleted!
vi: Khoản chi đã xoá thành công!

# msgDeleteExpenseFailed
source: Delete expense failed!
vi: Xóa chi phí không thành công!

# msgCreateExpenseSuccess
source: New expense has been created!
vi: Chi phí mới đã được thêm!

# msgCreateExpenseFailed
source: Expense create failed!
vi: Thêm chi phí không thành công!

source: Sign in with Google
vi: Đăng nhập bằng Google

source: other
vi: khác

source: You are offline!
vi: Bạn đang Offline!

source: An error occurred!
vi: Đã xảy ra lỗi!

source: You spent:
vi: Đã sử dụng:
